/*
 * The 失乐园方案驱动器
 
 */

#include <stdio.h>
#include <stdlib.h>

#include "失乐园.h"

int main(int 实参计数, char *实参值[])
{
  int 读求值印环;
  失乐园_状态_类型* 大失;

  读求值印环 = 0;
  if(实参计数 == 1) {
    读求值印环 = 1;
  } else if(实参计数 != 2) {
    fprintf(stderr, "%s: Need 文件 to run.\n", 实参值[0]);
    exit(13);
  }

  大失 = 失乐园_打开();

  if(读求值印环) {
    失乐园_推_当前_输入_端口(大失);
    失乐园_推_当前_输出_端口(大失);
    失乐园_读求值印环(大失);
  } else {
    失乐园_推_串(大失, 实参值[1]);
    失乐园_载入_文件(大失, -1);
    失乐园_弹(大失, 2);
  }

  失乐园_关闭(大失);

  return 0;
}

