/*
 * The 失乐园方案 标准过程
 
 */

#include <stdio.h>
#include <stddef.h>
#include <stdlib.h>

#include "失乐园.h"
#include "对象.h"

/*
 * R5RS 6.2.5
 */

static int 对比(失乐园_状态_类型* 大失, int c)
{
  int 计数甲, 返回短, 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 == 0) {
    失乐园_推_串(大失, "cannot 对比 zero numbers");
    失乐园_错误(大失, 1);
  } else if(实参数号 == 1) {
    if(!失乐园_谓词号码(大失, 0)) {
      失乐园_推_串(大失, "cannot 对比 single non-number");
      失乐园_错误(大失, 1);
    } else {
      失乐园_推_布尔(大失, 1);
    }
  } else {
    for(计数甲 = 0; 计数甲 < 实参数号 - 1; 计数甲++) {
      switch(c) {
      case 0:
        返回短 = 失乐园_小于_(大失, 计数甲, 计数甲+1);
        break;
      case 1:
        返回短 = 失乐园_大于_(大失, 计数甲, 计数甲+1);
        break;
      default:
	abort();
      }
      if(!返回短) {
	失乐园_推_布尔(大失, 0);
	return 1;
      }
    }
    失乐园_推_布尔(大失, 1);
  }

  return 1;
}

static int 小_于(失乐园_状态_类型* 大失)
{
  return 对比(大失, 0);
}

static int 大_于(失乐园_状态_类型* 大失)
{
  return 对比(大失, 1);
}

static int 加(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 == 0) {
    失乐园_推_整数(大失, 0);
  } else if(实参数号 == 1) {
    if(!失乐园_谓词号码(大失, 0)) {
      失乐园_推_串(大失, "cannot add single non-number");
      失乐园_错误(大失, 1);
    }
  } else {
    失乐园_加法(大失, 实参数号);
  }

  return 1;
}

static int 减(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 == 0) {
    失乐园_推_串(大失, "not enough numbers to subtract");
    失乐园_错误(大失, 1);
  } else if(实参数号 == 1) {
    失乐园_一元_减号(大失, 0);
  } else  {
    失乐园_减法(大失, 实参数号);
  }

  return 1;
}

static int 除(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 == 0) {
    失乐园_推_串(大失, "not enough numbers to 除");
    失乐园_错误(大失, 1);
  } else if(实参数号 == 1) {
    失乐园_颠倒(大失, 0);
  } else  {
    失乐园_分号(大失, 实参数号);
  }

  return 1;
}

static int _环绕(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  } else {
    失乐园_环绕(大失, 0);
  }

  return 1;
}

static int 商(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  } else {
    失乐园_分号(大失, 2);
  }

  return 1;
}

static int 余数(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  } else {
    失乐园_余数(大失, 0, 1);
  }

  return 1;
}

/*
 * R5RS 6.2.6
 */

static int 数号_到_串(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  } else {
    失乐园_数号_到_串(大失, 0);
  }

  return 1;
}

/*
 * R5RS 6.3.2
 */

static int 构造短(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  失乐园_构造(大失, 0, 1);

  return 1;
}

static int 切头(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词点对(大失, 0)) {
    失乐园_推_串(大失, "cannot extract the 切头 of non-点对");
    失乐园_错误(大失, 1);
  }

  失乐园_切头(大失, 0);

  return 1;
}

static int 切尾(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词点对(大失, 0)) {
    失乐园_推_串(大失, "cannot extract the 切尾 of non-点对");
    失乐园_错误(大失, 1);
  }

  失乐园_切尾(大失, 0);

  return 1;
}

static int 列表问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词列表(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

/*
 * R5RS 6.3.3
 */

static int 串_到_符号(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  失乐园_串_到_符号(大失, 0);

  return 1;
}

static int 符号_到_串(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  失乐园_符号_到_串(大失, 0);

  return 1;
}

/*
 * R5RS 6.3.5
 */

static int 串问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词串(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 串_长度(失乐园_状态_类型* 大失)
{
  uint32_t 长度短;
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  长度短 = 失乐园_串_长度(大失, 0);
  失乐园_推_整数(大失, 长度短);

  return 1;
}

static int 串_引用(失乐园_状态_类型* 大失)
{
  失乐园_印刻_类型 c;
  int 计数甲, 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词串(大失, 0)) {
    失乐园_推_串(大失, "cannot index non-string");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词整数(大失, 1)) {
    失乐园_推_串(大失, "cannot index string using a non-integer");
    失乐园_错误(大失, 1);
  }

  计数甲 = 失乐园_到_整数(大失, 1);
  c = 失乐园_串_引用(大失, 计数甲, 0);
  失乐园_推_印刻(大失, c);

  return 1;
}

static int 串_追加(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 == 0) {
    失乐园_推_串(大失, "cannot append zero strings");
    失乐园_错误(大失, 1);
  } else {
    失乐园_连接(大失, 实参数号);
  }

  return 1;
}

/*
 * R5RS 6.3.6
 */

static int 向量问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词向量(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 制作_向量(失乐园_状态_类型* 大失)
{
  int 计数甲, 大小, 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1 && 实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词整数(大失, 0)) {
    失乐园_推_串(大失, "non-integer 大小 given to vector: ");
    失乐园_推_值(大失, 0);
    失乐园_错误(大失, 2);
  }

  大小 = 失乐园_到_整数(大失, 0);
  失乐园_推_向量(大失, 大小);

  if(实参数号 == 2) {
    for(计数甲 = 0; 计数甲 < 大小; 计数甲++) {
      失乐园_推_值(大失, 1);
      失乐园_向量_设置(大失, 计数甲, -2);
    }
  }

  return 1;
}

static int 向量_长度(失乐园_状态_类型* 大失)
{
  uint32_t 长度短;
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  长度短 = 失乐园_向量_长度(大失, 0);
  失乐园_推_整数(大失, 长度短);

  return 1;
}

static int 向量_引用(失乐园_状态_类型* 大失)
{
  int 计数甲, 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词向量(大失, 0)) {
    失乐园_推_串(大失, "cannot index non-vector");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词整数(大失, 1)) {
    失乐园_推_串(大失, "cannot index vector using a non-integer");
    失乐园_错误(大失, 1);
  }

  计数甲 = 失乐园_到_整数(大失, 1);
  失乐园_向量_引用(大失, 计数甲, 0);

  return 1;
}

static int 向量_设置(失乐园_状态_类型* 大失)
{
  int 计数甲, 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 3) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词向量(大失, 0)) {
    失乐园_推_串(大失, "cannot set non-vector");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词整数(大失, 1)) {
    失乐园_推_串(大失, "cannot index vector using a non-integer");
    失乐园_错误(大失, 1);
  }

  计数甲 = 失乐园_到_整数(大失, 1);
  失乐园_向量_设置(大失, 计数甲, 0);
  失乐园_弹(大失, 1);

  return 1;
}

/*
 * R5RS 6.4
 */

static int 过程问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词过程(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 应用(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 < 2) {
    失乐园_推_串(大失, "too few arguments to 应用");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词过程(大失, 0)) {
    失乐园_推_串(大失, "cannot 应用 non-procedure");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词列表(大失, -1)) {
    失乐园_推_串(大失, "最后 argument to 应用 must be a 点对");
    失乐园_错误(大失, 1);
  }

  失乐园_应用(大失, 0, 实参数号-1);

  return 1;
}

/*
 * R5RS 6.5
 */

static int 求值(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  失乐园_求值(大失, 0);

  return 1;
}

static int 载入(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  失乐园_载入_文件(大失, 0);

  return 1;
}

/*
 * R5RS 6.6.1
 */

static int 输入_端口问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词输入_端口(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 文件终_对象问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词文件终_对象(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 输出_端口问(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词输出_端口(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 打开_输入_文件(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词串(大失, 0)) {
    失乐园_推_串(大失, "文件 名称 must be a string: ");
    失乐园_推_值(大失, 0);
    失乐园_错误(大失, 2);
  }

  失乐园_打开_输入_文件(大失);

  return 1;
}

static int 打开_输出_文件(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词串(大失, 0)) {
    失乐园_推_串(大失, "文件 名称 must be a string: ");
    失乐园_推_值(大失, 0);
    失乐园_错误(大失, 2);
  }

  失乐园_打开_输出_文件(大失);

  return 1;
}

static int 关闭_输入_端口(失乐园_状态_类型 *大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词输入_端口(大失, 0)) {
    失乐园_推_串(大失, "cannot close non-input 端口");
    失乐园_推_值(大失, 0);
    失乐园_错误(大失, 2);
  }

  失乐园_关闭_输入_端口(大失);

  return 0;
}

static int 关闭_输出_端口(失乐园_状态_类型 *大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词输出_端口(大失, 0)) {
    失乐园_推_串(大失, "cannot close non-output 端口");
    失乐园_推_值(大失, 0);
    失乐园_错误(大失, 2);
  }

  失乐园_关闭_输入_端口(大失);

  return 0;
}

/*
 * R5RS 6.6.3
 */

static int 写(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1 && 实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(实参数号 == 1) {
    失乐园_推_当前_输出_端口(大失);
  }

  失乐园_写(大失, 0, 1);

  return 0;
}

static int 显示(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1 && 实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(实参数号 == 1) {
    失乐园_推_当前_输出_端口(大失);
  }

  失乐园_显示(大失, 0, 1);

  return 0;
}

static int 新行(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 0 && 实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(实参数号 == 0) {
    失乐园_推_当前_输出_端口(大失);
  }

  失乐园_新行(大失, 0);

  return 0;
}

static int 写_印刻(失乐园_状态_类型* 大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1 && 实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词印刻(大失, 0)) {
    失乐园_推_串(大失, "cannot 写 non-char: ");
    失乐园_推_值(大失, 0);
    失乐园_错误(大失, 2);
  }

  if(实参数号 == 1) {
    失乐园_推_当前_输出_端口(大失);
  }

  失乐园_显示(大失, 0, 1);

  return 0;
}

/*
 * boxes
 */

static int 盒子(失乐园_状态_类型 *大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  失乐园_盒子_(大失);

  return 1;
}

static int 盒子问(失乐园_状态_类型 *大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(失乐园_谓词盒子(大失, 0)) {
    失乐园_推_布尔(大失, 1);
  } else {
    失乐园_推_布尔(大失, 0);
  }

  return 1;
}

static int 拆盒(失乐园_状态_类型 *大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 1) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词盒子(大失, 0)) {
    失乐园_推_串(大失, "cannot 拆盒 non-盒子!");
    失乐园_错误(大失, 1);
  }

  失乐园_拆盒(大失);

  return 1;
}

static int 设置_盒子(失乐园_状态_类型 *大失)
{
  int 实参数号 = 失乐园_取_顶部(大失);

  if(实参数号 != 2) {
    失乐园_推_串(大失, "wrong number of arguments");
    失乐园_错误(大失, 1);
  }

  if(!失乐园_谓词盒子(大失, 0)) {
    失乐园_推_串(大失, "cannot set non-盒子!");
    失乐园_错误(大失, 1);
  }

  失乐园_设置_盒子(大失, 0);

  return 1;
}

/*
 * 错误 握住
 */

static int 错误(失乐园_状态_类型* 大失)
{
  return 失乐园_错误(大失, 失乐园_取_顶部(大失));
}

static 失乐园_寄存_类型 标准_寄存[] = {
  {"<", 小_于},
  {">", 大_于},
  {"+", 加},
  {"-", 减},
  {"/", 除},
  {"环绕", _环绕},
  {"商", 商},
  {"余数", 余数},
  {"号码->串", 数号_到_串},
  {"构造", 构造短},
  {"切头", 切头},
  {"切尾", 切尾},
  {"列表?", 列表问},
  {"串->符号", 串_到_符号},
  {"符号->串", 符号_到_串},
  {"串?", 串问},
  {"串-长度", 串_长度},
  {"串-引用", 串_引用},
  {"串-追加", 串_追加},
  {"向量?", 向量问},
  {"制作-向量", 制作_向量},
  {"向量-长度", 向量_长度},
  {"向量-引用短", 向量_引用},
  {"向量-设置!", 向量_设置},
  {"过程?", 过程问},
  {"应用", 应用},
  {"求值", 求值},
  {"载入", 载入},
  {"文件终-对象?", 文件终_对象问},
  {"输入-端口?", 输入_端口问},
  {"输出-端口?", 输出_端口问},
  {"打开-输入-文件", 打开_输入_文件},
  {"打开-输出-文件", 打开_输出_文件},
  {"关闭-输入-端口", 关闭_输入_端口},
  {"关闭-输出-端口", 关闭_输出_端口},
  {"写", 写},
  {"显示", 显示},
  {"新行", 新行},
  {"写-印刻", 写_印刻},
  {"盒子", 盒子},
  {"盒子?", 盒子问},
  {"拆盒", 拆盒},
  {"设置-盒子!", 设置_盒子},
  {"错误", 错误},
  {NULL, NULL}
};

int 失乐园_打开_标准(失乐园_状态_类型* 大失)
{
  失乐园_寄存器(大失, 标准_寄存);

  return 0;
}

