#include "定义.h"
#include "数据.h"
#include "声明.h"

//抽象句法树的树解释器
//抽象句法树操作的列表
static char *抽象句法树操作[] = {"+","-","*","/"};

//给定一个抽象句法树,
//解释里面的操作,返回一个最终值.
int 解释抽象句法树(struct 抽象句法树节点 *个数){
	int 左值,右值;

	//取左与右的子树值
	if(个数->左)
		左值 = 解释抽象句法树(个数->左);
	if(个数->右)
		右值 = 解释抽象句法树(个数->右);

	//调试: 打印我们将要做的事
	if(个数->操作 == 抽象_整型字面)
		printf("整型 %d\n",个数->整型值);
	else
		printf("%d %s %d\n",左值,抽象句法树操作[个数->操作],右值);

	switch (个数->操作){
		case 抽象_加法:
			return (左值 + 右值);
		case 抽象_减法:
			return (左值 - 右值);
		case 抽象_乘法:
			return (左值 * 右值);
		case 抽象_除法:
			return (左值 / 右值);
		case 抽象_整型字面:
			return (个数->整型值);
		default:
			fprintf(stderr,"未知抽象句法树操作 %d\n",个数->操作);
			exit(1);
	}
}