/*
** $Id: ldump.c $
** 月词法_保存_函 precompiled Lua chunks
** See Copyright Notice in lua.h
*/

#define ldump_c
#define 应程接_月亮_内核_宏名

#include "lprefix.h"


#include <limits.h>
#include <stddef.h>

#include "lua.h"

#include "lobject.h"
#include "lstate.h"
#include "lundump.h"


typedef struct {
  炉_状态机结 *L;
  炉_写器结 写器_小写;
  void *数据_变量;
  int 剥离_变量;
  int 状态码_变量;
} 转储状态机_结;


/*
** All high-层级_变量 dumps go through 转储_转储向量_宏名; you can 改变_变量 it 到_变量
** 改变_变量 the endianness of the 结果_变量
*/
#define 转储_转储向量_宏名(D,v,n)	月转储_转储块_函(D,v,(n)*sizeof((v)[0]))

#define 转储_转储字面量_宏名(D, s)	月转储_转储块_函(D,s,sizeof(s) - sizeof(char))


static void 月转储_转储块_函 (转储状态机_结 *D, const void *b, size_t 大小_变量) {
  if (D->状态码_变量 == 0 && 大小_变量 > 0) {
    限制_月亮_解锁_宏名(D->L);
    D->状态码_变量 = (*D->写器_小写)(D->L, b, 大小_变量, D->数据_变量);
    限制_月亮_锁_宏名(D->L);
  }
}


#define 转储_转储变量_宏名(D,x)		转储_转储向量_宏名(D,&x,1)


static void 月转储_转储字节_函 (转储状态机_结 *D, int y) {
  路_字节型 x = (路_字节型)y;
  转储_转储变量_宏名(D, x);
}


/*
** '月转储_转储大小_函' 缓冲区_变量 大小_变量: each byte can store 上_小变量 到_变量 7 bits. (The "+6"
** rounds 上_小变量 the division.)
*/
#define 转储_用步进做它_宏名    ((sizeof(size_t) * CHAR_BIT + 6) / 7)

static void 月转储_转储大小_函 (转储状态机_结 *D, size_t x) {
  路_字节型 缓冲_变量[转储_用步进做它_宏名];
  int n = 0;
  do {
    缓冲_变量[转储_用步进做它_宏名 - (++n)] = x & 0x7f;  /* fill 缓冲区_变量 in 月应程接_逆向_函 order */
    x >>= 7;
  } while (x != 0);
  缓冲_变量[转储_用步进做它_宏名 - 1] |= 0x80;  /* 记号_变量 最后_变量 byte */
  转储_转储向量_宏名(D, 缓冲_变量 + 转储_用步进做它_宏名 - n, n);
}


static void 月转储_转储整型_函 (转储状态机_结 *D, int x) {
  月转储_转储大小_函(D, x);
}


static void 月转储_转储数目_函 (转储状态机_结 *D, 炉_数目型 x) {
  转储_转储变量_宏名(D, x);
}


static void 月转储_转储整数_函 (转储状态机_结 *D, 炉_整数型 x) {
  转储_转储变量_宏名(D, x);
}


static void 月转储_转储字符串_函 (转储状态机_结 *D, const 标签字符串_结 *s) {
  if (s == NULL)
    月转储_转储大小_函(D, 0);
  else {
    size_t 大小_变量 = 对象_tss长度_宏名(s);
    const char *串_变量 = 对象_获取串_宏名(s);
    月转储_转储大小_函(D, 大小_变量 + 1);
    转储_转储向量_宏名(D, 串_变量, 大小_变量);
  }
}


static void 月转储_转储代码_函 (转储状态机_结 *D, const 原型_结 *f) {
  月转储_转储整型_函(D, f->代码大小_小写);
  转储_转储向量_宏名(D, f->代码_变量, f->代码大小_小写);
}


static void 月转储_转储函数_函(转储状态机_结 *D, const 原型_结 *f, 标签字符串_结 *psource);

static void 月转储_转储常量们_函 (转储状态机_结 *D, const 原型_结 *f) {
  int i;
  int n = f->k大小_缩;
  月转储_转储整型_函(D, n);
  for (i = 0; i < n; i++) {
    const 标签值_结 *o = &f->k[i];
    int 类标_缩变量 = 对象_t类型标签_宏名(o);
    月转储_转储字节_函(D, 类标_缩变量);
    switch (类标_缩变量) {
      case 对象_月亮_V数目浮点_宏名:
        月转储_转储数目_函(D, 对象_浮点值_宏名(o));
        break;
      case 对象_月亮_V数目整型_宏名:
        月转储_转储整数_函(D, 对象_整数值_宏名(o));
        break;
      case 对象_月亮_V短型串_宏名:
      case 对象_月亮_V长型串_宏名:
        月转储_转储字符串_函(D, 对象_ts值_宏名(o));
        break;
      default:
        限制_月亮_断言_宏名(类标_缩变量 == 对象_月亮_V空值_宏名 || 类标_缩变量 == 对象_月亮_V假_宏名 || 类标_缩变量 == 对象_月亮_V真_宏名);
    }
  }
}


static void 月转储_转储原型_函 (转储状态机_结 *D, const 原型_结 *f) {
  int i;
  int n = f->p大小_缩;
  月转储_转储整型_函(D, n);
  for (i = 0; i < n; i++)
    月转储_转储函数_函(D, f->p[i], f->源_圆);
}


static void 月转储_转储上值们_函 (转储状态机_结 *D, const 原型_结 *f) {
  int i, n = f->上值大小_小写;
  月转储_转储整型_函(D, n);
  for (i = 0; i < n; i++) {
    月转储_转储字节_函(D, f->上值们_小写[i].栈内_小写);
    月转储_转储字节_函(D, f->上值们_小写[i].索引_缩变量);
    月转储_转储字节_函(D, f->上值们_小写[i].种类_变量);
  }
}


static void 月转储_转储调试_函 (转储状态机_结 *D, const 原型_结 *f) {
  int i, n;
  n = (D->剥离_变量) ? 0 : f->行信息大小_小写;
  月转储_转储整型_函(D, n);
  转储_转储向量_宏名(D, f->行信息_变量, n);
  n = (D->剥离_变量) ? 0 : f->绝对行信息大小_小写;
  月转储_转储整型_函(D, n);
  for (i = 0; i < n; i++) {
    月转储_转储整型_函(D, f->绝对行信息_小写[i].程序计数_变量);
    月转储_转储整型_函(D, f->绝对行信息_小写[i].行_变量);
  }
  n = (D->剥离_变量) ? 0 : f->本地变量大小_短;
  月转储_转储整型_函(D, n);
  for (i = 0; i < n; i++) {
    月转储_转储字符串_函(D, f->本地变量们_短[i].变量名称_变量);
    月转储_转储整型_函(D, f->本地变量们_短[i].始程计_缩);
    月转储_转储整型_函(D, f->本地变量们_短[i].终程计_缩);
  }
  n = (D->剥离_变量) ? 0 : f->上值大小_小写;
  月转储_转储整型_函(D, n);
  for (i = 0; i < n; i++)
    月转储_转储字符串_函(D, f->上值们_小写[i].名称_变量);
}


static void 月转储_转储函数_函 (转储状态机_结 *D, const 原型_结 *f, 标签字符串_结 *psource) {
  if (D->剥离_变量 || f->源_圆 == psource)
    月转储_转储字符串_函(D, NULL);  /* no debug 信息_短变量 or same 源_圆 as its parent */
  else
    月转储_转储字符串_函(D, f->源_圆);
  月转储_转储整型_函(D, f->已定义行_小写);
  月转储_转储整型_函(D, f->最后已定义行_小写);
  月转储_转储字节_函(D, f->形参数_小写);
  月转储_转储字节_函(D, f->是否_变量实参短);
  月转储_转储字节_函(D, f->最大栈大小_小写);
  月转储_转储代码_函(D, f);
  月转储_转储常量们_函(D, f);
  月转储_转储上值们_函(D, f);
  月转储_转储原型_函(D, f);
  月转储_转储调试_函(D, f);
}


static void 月转储_转储头部_函 (转储状态机_结 *D) {
  转储_转储字面量_宏名(D, 月头_月亮_签名_宏名);
  月转储_转储字节_函(D, 反转储_月亮C_版本_宏名);
  月转储_转储字节_函(D, 反转储_月亮C_格式_宏名);
  转储_转储字面量_宏名(D, 反转储_月亮C_数据_宏名);
  月转储_转储字节_函(D, sizeof(Instruction));
  月转储_转储字节_函(D, sizeof(炉_整数型));
  月转储_转储字节_函(D, sizeof(炉_数目型));
  月转储_转储整数_函(D, 反转储_月亮C_整型_宏名);
  月转储_转储数目_函(D, 反转储_月亮C_数目_宏名);
}


/*
** dump Lua function as precompiled chunk
*/
int 月亮实用工具_转储_函(炉_状态机结 *L, const 原型_结 *f, 炉_写器结 w, void *数据_变量,
              int 剥离_变量) {
  转储状态机_结 D;
  D.L = L;
  D.写器_小写 = w;
  D.数据_变量 = 数据_变量;
  D.剥离_变量 = 剥离_变量;
  D.状态码_变量 = 0;
  月转储_转储头部_函(&D);
  月转储_转储字节_函(&D, f->上值大小_小写);
  月转储_转储函数_函(&D, f, NULL);
  return D.状态码_变量;
}

