#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#include "c数组.h"

int main(){
	printf("\n  c 数组 \n");

	c数组 *数组 = 取c数组(10);
	int 甲;
	for(甲 = 0;甲 < 数组 -> 大小;甲++){
		插入值c数组(数组,甲,甲 + 1);
	}
	printf("键入数组是: \n");
	显示c数组(数组);
	printf("\n 代码: %d \n",推值c数组(数组,11));

	for(甲 = 0;甲 < 数组 -> 大小;甲++){
		移除值c数组(数组,甲);
	}
	显示c数组(数组);
	printf("\n 代码: %d ",移除值c数组(数组,-1));
	printf("\n 代码: %d \n",插入值c数组(数组,-1,1));

	for(甲 = 0;甲 < 数组 -> 大小;甲++){
		插入值c数组(数组,甲,甲+1);
	}
	擦除c数组(数组);
	显示c数组(数组);

	c数组 *小数组 = 取c数组(13);
	for(甲 = 0;甲< 小数组 -> 大小;甲++){
		插入值c数组(小数组,甲,甲+1);
	}
	显示c数组(小数组);
	for(甲 = 0;甲< 小数组 -> 大小 / 2;甲++){
		切换值c数组(小数组,甲,小数组 -> 大小 - 甲 - 1);
	}
	显示c数组(小数组);
	逆向c数组(小数组);
	显示c数组(小数组);

	srand(time(NULL));
	c数组 *二数组 = 取c数组(20);
	for(甲 = 0;甲 < 二数组 -> 大小; 甲++){
		插入值c数组(二数组,甲,rand());
	}
	c数组 *三数组 = 取复制c数组(二数组);
	c数组 *四数组 = 取复制c数组(二数组);
	printf("\n 不排序数组: ");
	显示c数组(二数组);
	printf("\n 冒泡排序: ");
	clock_t 开始1 = clock();
	冒泡排序c数组(二数组);
	clock_t 终1 = clock();
	double 耗费时间1 = (double)(终1 - 开始1) / CLOCKS_PER_SEC;
	显示c数组(二数组);

	printf("\n 选择排序: ");
	clock_t 开始2 = clock();
	选择排序c数组(三数组);
	clock_t 终2 = clock();
	double 耗费时间2 = (double)(终2 - 开始2) / CLOCKS_PER_SEC;
	显示c数组(三数组);

	printf("\n 插入排序: ");
	clock_t 开始3 = clock();
	插入排序c数组(四数组);
	clock_t 终3 = clock();
	double 耗费时间3 = (double)(终3 - 开始3) / CLOCKS_PER_SEC;
	显示c数组(三数组);
	逆向c数组(二数组);

	printf("\n 总共时间耗费冒泡排序: %lf 秒",耗费时间1);
	printf("\n 总共时间耗费选择排序: %lf 秒",耗费时间2);
	printf("\n 总共时间耗费插入排序: %lf 秒",耗费时间3);

	c数组 *一数组 = 取c数组(1000);
	for(甲 = 0;甲< 一数组 -> 大小;甲++){
		插入值c数组(一数组,甲,rand()% 100);
	}
	int 乙 = 24;
	printf("\n 杂狗支撑的号码 %d 在数组里: %d ",乙,值杂狗支撑c数组(一数组,乙));
	printf("\n 与它的位置: \n");
	c数组 *位置 = 值位置c数组(一数组,乙);
	显示c数组(位置);
	printf("\n 所有 %d s",乙);
	for(甲 = 0; 甲 < 位置 -> 大小;甲++){
		printf("\n 位置 %d 有一值是 %d ",位置->数组[甲],一数组->数组[位置->数组[甲]]);

	}
	printf("\n 列表有一个最小值 %d 和一个最大值 %d ",找最小c数组(一数组),找最大c数组(一数组));
	插入排序c数组(一数组);
	显示c数组(一数组);

	free(小数组);
	free(数组);
	free(一数组);
	free(二数组);
	free(三数组);
	free(四数组);
	printf("\n");
	return 0;

}