#include "定义.h"
#include "数据.h"
#include "声明.h"

//通用代码生成器
//给定一个抽象句法树,递归地生成汇编代码,
static int 生成抽象句法树(struct 抽象句法树节点 *节点){
	int 左寄存,右寄存;

	//取此左与右子树值
	if(节点->左)
		左寄存 = 生成抽象句法树(节点->左);
	if(节点->右)
		右寄存 = 生成抽象句法树(节点->右);

	switch(节点->操作){
		case 抽象_加法:
			return (代码生成器加(左寄存,右寄存));
		case 抽象_减法:
			return (代码生成器减(左寄存,右寄存));
		case 抽象_乘法:
			return (代码生成器乘(左寄存,右寄存));
		case 抽象_除法:
			return (代码生成器除(左寄存,右寄存));
		case 抽象_整型字面:
			return (代码生成器载入(节点->整型值));
		default:
			fprintf(stderr,"未知抽象句法树操作 %d\n", 节点->操作);
			exit(1);
	}
}

void 生成代码(struct 抽象句法树节点 *节点){
	int 寄存;

	代码生成器前文();
	寄存 = 生成抽象句法树(节点);
	代码生成器打印整型(寄存);
	代码生成器后文();
}