#include <iostream>
using namespace std;

struct 个人{ string 成员_名; int 成员_性别; int 成员_年龄; 
            string 成员_电话; string 成员_地址;};

#define 最大 1000
struct 地址书{ struct 个人 个人数组[最大]; int 成员_大小;};

void 秀菜单(){
    cout<<"******************************"<<endl;
    cout<<"*****1-添加联系人**************"<<endl;
    cout<<"*****2-显示联系人**************"<<endl;
    cout<<"*****3-删除联系人**************"<<endl;
    cout<<"*****4-查找联系人**************"<<endl;
    cout<<"*****5-修改联系人**************"<<endl;
    cout<<"*****6-清空联系人**************"<<endl;
    cout<<"*****0-退出通讯录**************"<<endl;
    cout<<"******************************"<<endl;

}

void 添加个人(地址书* 通讯录){
    if(通讯录->成员_大小 == 最大){
        cout<<"通讯录已满,无法添加"<<endl; return;}
    else{string 名字; cout<<"请输入姓名:"<<endl; cin>>名字;
        通讯录->个人数组[通讯录->成员_大小].成员_名=名字;
        cout<<"请输入性别:"<<endl; cout<<"1-男"<<endl; cout<<"2-女"<<endl;
        int 性别 =0; while(true){
            cin>>性别; if(性别==1 || 性别==2){
                通讯录->个人数组[通讯录->成员_大小].成员_性别 = 性别;
                break; }
            cout<<"输入有误,重新输入";}
        cout<<"请输入年龄:"<<endl; int 年龄=0; cin>>年龄;
        通讯录->个人数组[通讯录->成员_大小].成员_年龄 = 年龄;
        cout<<"请输入联系电话:"<<endl; string 电话 = ""; cin>>电话;
        通讯录->个人数组[通讯录->成员_大小].成员_电话 = 电话;
        cout<<"请输入住址:"<<endl; string 地址; cin>>地址;
        通讯录->个人数组[通讯录->成员_大小].成员_地址 = 地址;
        通讯录->成员_大小++; cout<<"添加成功"<<endl; system("pause");}
}

void 秀个人(地址书* 通讯录){
    if(通讯录->成员_大小==0){cout<<"当前记录为空"<<endl;}
    else{for(int 甲=0;甲<通讯录->成员_大小;甲++)
    {cout<<"姓名:"<<通讯录->个人数组[甲].成员_名<<"\t";
    cout<<"性别:"<<(通讯录->个人数组[甲].成员_性别==1 ? "男" : "女")<<"\t";
    cout<<"年龄:"<<通讯录->个人数组[甲].成员_年龄<<"\t";
    cout<<"电话:"<<通讯录->个人数组[甲].成员_电话<<"\t";
    cout<<"住址:"<<通讯录->个人数组[甲].成员_地址<<endl;}} system("pause");
}

int 是否存在(地址书* 通讯录,string 名字){
    for(int 甲=0;甲<通讯录->成员_大小;甲++){
        if(通讯录->个人数组[甲].成员_名==名字){
            return 甲;
        }
    }
    return -1;
}

void 删除个人(地址书* 通讯录){
    cout<<"输入你想删除的联系人"<<endl; string 名字; cin>>名字;
    int 返来=是否存在(通讯录,名字); if(返来 != -1){
        for(int 甲=返来;甲<通讯录->成员_大小;甲++){
            通讯录->个人数组[甲]=通讯录->个人数组[甲+1];
        } 通讯录->成员_大小--; cout<<"删除成功"<<endl;
    } else {cout<<"查无此人"<<endl;} system("pause");
}

void 找个人(地址书* 通讯录)
{
    cout<<"输入你要找的人"<<endl; string 名字; cin>>名字;
    int 返来=是否存在(通讯录,名字);
    if(返来 != -1)
    {cout<<"姓名:"<<通讯录->个人数组[返来].成员_名<<"\t";
    cout<<"性别:"<<通讯录->个人数组[返来].成员_性别<<"\t";
    cout<<"年龄:"<<通讯录->个人数组[返来].成员_年龄<<"\t";
    cout<<"电话:"<<通讯录->个人数组[返来].成员_电话<<"\t";
    cout<<"住址:"<<通讯录->个人数组[返来].成员_地址<<endl;}
    else{cout<<"查无此人"<<endl;} system("pause");
}

void 修改个人(地址书* 通讯录)
{
    cout<<"输入想修改的人"<<endl; string 名字; cin>>名字;
    int 返来=是否存在(通讯录,名字); if(返来 != -1){
        string 名字; cout<<"输入名字:"<<endl; cin>>名字;
        通讯录->个人数组[返来].成员_名 = 名字;
        cout<<"输入性别:"<<endl;cout<<"1-男:"<<endl;cout<<"2-女:"<<endl;
        int 性别=0; while(true){
            cin>>性别; if(性别==1 || 性别==2){
                通讯录->个人数组[返来].成员_性别 = 性别; break;
            } cout<<"输入有误,重新输入";
        } cout<<"输入年龄:"<<endl; int 年龄=0; cin>>年龄;
        通讯录->个人数组[返来].成员_年龄 = 年龄;
        cout<<"输入电话:"<<endl; string 电话=""; cin>>电话;
        通讯录->个人数组[返来].成员_电话 = 电话;
        cout<<"输入住址 :"<<endl; string 地址=""; cin>>地址;
        通讯录->个人数组[返来].成员_地址 = 地址;
        cout<<"修改成功"<<endl;     
    }else{cout<<"查无此人"<<endl;}  system("pause");
}

void 清除个人(地址书* 通讯录)
{
    通讯录->成员_大小=0; cout<<"已做逻辑清空"<<endl; system("pause");
}

int main()
{
    //创建通讯录
    地址书 通讯录; 通讯录.成员_大小 = 0;

    int 选择 = 0; while(true){
        秀菜单();
        cin>>选择; switch(选择){
            case 1: 添加个人(&通讯录); break;
            case 2: 秀个人(&通讯录); break; 
            case 3: 删除个人(&通讯录); break;
            case 4: 找个人(&通讯录); break; 
            case 5: 修改个人(&通讯录); break; 
            case 6: 清除个人(&通讯录); break;
            case 0: cout<<"正在退出..."<<endl; return 0; break;
            default: break;
        }
    }
    
    return 0;
}